source/InformationRegisters/VKRDocumentLinks.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>VKRDocumentLinks</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Event</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.KadrovoyeIzmenenie</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.UvolnenieSotrudnika</v8:Type>
						<v8:Type>cfg:DocumentRef.IzmenenieDolzhnosti</v8:Type>
						<v8:Type>cfg:DocumentRef.PerevodSotrudnika</v8:Type>
						<v8:Type>cfg:DocumentRef.IzmeneniePodrazdeleniya</v8:Type>
						<v8:Type>cfg:DocumentRef.PriemSotrudnika</v8:Type>
						<v8:Type>cfg:DocumentRef.IzmenenieOklada</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

source/Documents/KadrovoyeIzmenenie.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>KadrovoyeIzmenenie</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.OtpravlennyeUvedomleniya</xr:Item>
				<xr:Item>AccumulationRegister.OshibkiOtpravkiUvedomleniy</xr:Item>
				<xr:Item>AccumulationRegister.KadrovyeSobytiya</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Sotrudnik</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Sotrudniki</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VidIzmeneniya</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VidyKadrovykhIzmeneniy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TipIzmeneniya</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TipyKadrovykhIzmeneniy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataIzmeneniya</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PodrazdelenieDo</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Podrazdeleniya</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PodrazdeleniePosle</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Podrazdeleniya</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DolzhnostDo</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Dolzhnosti</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DolzhnostPosle</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Dolzhnosti</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OkladDo</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OkladPosle</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Osnovanie</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Otvetstvennyy</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TrebuyetsyaUvedomleniye</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StatusUvedomleniya</Name>
					<Type>
						<v8:Type>cfg:EnumRef.StatusyUvedomleniy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Kommentariy</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VKRManualRecipients</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VKRReason</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PrichinyKadrovykhIzmeneniy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VKRSourceKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VidyDokumentovOsnovaniy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Poluchateli</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Poluchatel</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.PoluchateliUvedomleniy</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Email</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Status</Name>
							<Type>
								<v8:Type>cfg:EnumRef.StatusyUvedomleniy</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Kommentariy</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

source/Catalogs/VidyKadrovykhIzmeneniy.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>VidyKadrovykhIzmeneniy</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>TipIzmeneniya</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TipyKadrovykhIzmeneniy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TrebuyetUvedomleniya</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Opisanie</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VKRDefault</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

source/CommonModules/VKRHR/Ext/Module.bsl
// Специализированные документы используют единый кадровый факт и общую очередь.
Процедура ПроверитьСобытие(Событие) Экспорт
    Если НЕ ЗначениеЗаполнено(Событие.Sotrudnik)
        Или НЕ ЗначениеЗаполнено(Событие.VidIzmeneniya)
        Или НЕ ЗначениеЗаполнено(Событие.DataIzmeneniya) Тогда
        ВызватьИсключение "Заполните сотрудника, вид и дату изменения.";
    КонецЕсли;
    Если Событие.Sotrudnik.ПометкаУдаления Или Событие.VidIzmeneniya.ПометкаУдаления Тогда
        ВызватьИсключение "Сотрудник или вид изменения помечен на удаление.";
    КонецЕсли;
    Для Каждого ИмяПоля Из СтрРазделить("PodrazdelenieDo,PodrazdeleniePosle,DolzhnostDo,DolzhnostPosle", ",") Цикл
        Значение = Событие[ИмяПоля];
        Если ЗначениеЗаполнено(Значение) Тогда
            Если Значение.ПометкаУдаления Или Значение.ЭтоГруппа Тогда
                ВызватьИсключение "Укажите действующий элемент в поле " + ИмяПоля;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

Функция ВидПоТипу(ТипИзменения)
    Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 2 Виды.Ссылка КАК Ссылка
        |ИЗ Справочник.VidyKadrovykhIzmeneniy КАК Виды
        |ГДЕ Виды.TipIzmeneniya = &Тип И НЕ Виды.ПометкаУдаления");
    Запрос.УстановитьПараметр("Тип", ТипИзменения);
    ОсновнойЗапрос = Новый Запрос(Запрос.Текст + " И Виды.VKRDefault");
    ОсновнойЗапрос.УстановитьПараметр("Тип", ТипИзменения);
    Таблица = ОсновнойЗапрос.Выполнить().Выгрузить();
    Если Таблица.Количество() = 0 Тогда
        // Совместимость с базами, созданными до появления признака основного вида.
        Таблица = Запрос.Выполнить().Выгрузить();
    КонецЕсли;
    Если Таблица.Количество() <> 1 Тогда
        ВызватьИсключение "Для типа изменения нужен ровно один действующий вид кадрового изменения.";
    КонецЕсли;
    Возврат Таблица[0].Ссылка;
КонецФункции

Процедура ПровестиИсточник(Источник, ТипИзменения) Экспорт
    Если НЕ ТранзакцияАктивна() Тогда
        ВызватьИсключение "Источник проводится в транзакции.";
    КонецЕсли;
    VKROutbox.Заблокировать("VKRDocumentLinks", "Source", Источник.Ссылка);
    Связь = РегистрыСведений.VKRDocumentLinks.СоздатьМенеджерЗаписи();
    Связь.Source = Источник.Ссылка;
    Связь.Прочитать();
    Если Связь.Выбран() Тогда
        Событие = Связь.Event.ПолучитьОбъект();
    Иначе
        Событие = Документы.KadrovoyeIzmenenie.СоздатьДокумент();
    КонецЕсли;
    Событие.Дата = Источник.Дата;
    Событие.Sotrudnik = Источник.Sotrudnik;
    Если ЗначениеЗаполнено(Источник.VKRChangeKind) Тогда
        Если Источник.VKRChangeKind.TipIzmeneniya <> ТипИзменения Тогда
            ВызватьИсключение "Вид изменения не соответствует типу кадрового документа.";
        КонецЕсли;
        Событие.VidIzmeneniya = Источник.VKRChangeKind;
    Иначе
        Событие.VidIzmeneniya = ВидПоТипу(ТипИзменения);
    КонецЕсли;
    Событие.TipIzmeneniya = ТипИзменения;
    Событие.Osnovanie = Источник.Osnovanie;
    Событие.TrebuyetsyaUvedomleniye = Событие.VidIzmeneniya.TrebuyetUvedomleniya;
    Событие.VKRManualRecipients = Ложь;
    Имя = Источник.Метаданные().Имя;
    // Совпадающие реквизиты переносятся по именам метаданных; старые UUID сохраняются.
    Для Каждого ИмяПоля Из СтрРазделить(
        "PodrazdelenieDo,PodrazdeleniePosle,DolzhnostDo,DolzhnostPosle,OkladDo,OkladPosle,Kommentariy,VKRReason,VKRSourceKind", ",") Цикл
        Если Источник.Метаданные().Реквизиты.Найти(ИмяПоля) <> Неопределено Тогда
            Событие[ИмяПоля] = Источник[ИмяПоля];
        КонецЕсли;
    КонецЦикла;
    Если Имя = "PriemSotrudnika" Тогда
        Событие.DataIzmeneniya = Источник.DataPriema;
        Событие.PodrazdeleniePosle = Источник.Podrazdelenie;
        Событие.DolzhnostPosle = Источник.Dolzhnost;
        Событие.OkladPosle = Источник.Oklad;
    ИначеЕсли Имя = "PerevodSotrudnika" Тогда
        Событие.DataIzmeneniya = Источник.DataPerevoda;
    ИначеЕсли Имя = "UvolnenieSotrudnika" Тогда
        Событие.DataIzmeneniya = Источник.DataUvolneniya;
        Событие.PodrazdelenieDo = Источник.Sotrudnik.Podrazdelenie;
        Событие.DolzhnostDo = Источник.Sotrudnik.Dolzhnost;
    Иначе
        Событие.DataIzmeneniya = Источник.DataIzmeneniya;
        Если Имя = "IzmenenieOklada" Или Имя = "IzmenenieDolzhnosti" Тогда
            Событие.PodrazdelenieDo = Источник.Sotrudnik.Podrazdelenie;
            Событие.PodrazdeleniePosle = Источник.Sotrudnik.Podrazdelenie;
        КонецЕсли;
    КонецЕсли;
    ПроверитьСобытие(Событие);
    Событие.Записать(РежимЗаписиДокумента.Проведение);
    Связь.Source = Источник.Ссылка;
    Связь.Event = Событие.Ссылка;
    Связь.Записать();
КонецПроцедуры

Процедура ОтменитьИсточник(Источник) Экспорт
    VKROutbox.Заблокировать("VKRDocumentLinks", "Source", Источник);
    Связь = РегистрыСведений.VKRDocumentLinks.СоздатьМенеджерЗаписи();
    Связь.Source = Источник;
    Связь.Прочитать();
    Если Связь.Выбран() И Связь.Event.Проведен Тогда
        Событие = Связь.Event.ПолучитьОбъект();
        Событие.Записать(РежимЗаписиДокумента.ОтменаПроведения);
    КонецЕсли;
КонецПроцедуры
